# Brewfile for macOS dotfiles setup
# Install with: brew bundle --file=~/.Brewfile

# Core tools
brew "fish"
brew "git"
brew "git-delta"
brew "github-cli"
brew "tmux"
brew "neovim"
brew "emacs"

# Search and file tools
brew "ripgrep"
brew "fd"
brew "eza"
brew "jq"
brew "tree"
brew "7zip"

# Development
brew "cmake"
brew "make"
brew "autoconf"
brew "automake"
brew "nodejs"
brew "npm"
brew "pnpm"
brew "uv"
brew "hugo"

# Cloud and DevOps
brew "azure-cli"
brew "docker"
brew "docker-compose"
brew "pulumi"

# System tools
brew "htop"
brew "syncthing"
brew "rsync"
brew "wget"
brew "curl"
brew "openssh"

# Media
brew "ffmpeg"
brew "mpv"
brew "yt-dlp"

# Fun
brew "cmatrix"
brew "cowsay"
brew "lolcat"

# Apps
cask "alacritty"
cask "ghostty"
cask "firefox"
cask "gimp"
cask "libreoffice"
